loadtest/stress-test.yml
# Artillery 로드테스트 설정
# 생성일: 2025-07-24T20:13:06.145Z

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 120
      arrivalRate: 10
      name: '급격한 부하 증가'
    - duration: 300
      arrivalRate: 20
      name: '고부하 지속'
    - duration: 60
      arrivalRate: 1
      name: '부하 해제'
  http:
    timeout: 45000
    pool: 10
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  variables:
    locations:
      - '경복궁'
      - '창덕궁'
      - '덕수궁'
      - '경희궁'
      - '종묘'
      - '사직단'
      - '남산타워'
      - '한강공원'
    interests:
      - '역사'
      - '문화'
      - '자연'
      - '건축'
      - '예술'
      - '음식'
    ageGroups:
      - '20대'
      - '30대'
      - '40대'
      - '50대'

scenarios:
  - name: '스트레스 테스트'
    weight: 100
    flow:
      - post:
          url: '/api/ai/generate-guide-with-gemini'
          headers:
            'Content-Type': 'application/json'
          json:
            {
                      "location": "{{ locations[$randomInt(0, locations.length-1)] }}",
                      "userProfile": {
                                "interests": [
                                          "{{ interests[$randomInt(0, interests.length-1)] }}"
                                ],
                                "ageGroup": "{{ ageGroups[$randomInt(0, ageGroups.length-1)] }}",
                                "knowledgeLevel": "중급",
                                "companions": "solo",
                                "tourDuration": 90,
                                "preferredStyle": "친근함",
                                "language": "ko"
                      }
            }
        expect:
          - statusCode: [200, 201, 429]
          - hasProperty: 'success'
        think: 2000